#include "stdafx.h"
#include <conio.h>
#include <windows.h>

/*
	n x n 크기의 행렬의 각 칸의 1부터 n^2(제곱) 까지의 숫자가 지그재그 방향으로 채워져있다.
	ex) 5 x 5
	1	2	6	7	15
	3	5	8	14	16
	4	9	13	17	22
	10	12	18	21	23
	11	19	20	24	25

	이때 r행, c옇의 칸에 어떤 숫자가 적혀있는지 구하려고한다.
	예를 들어 위에서 r = 3, c = 2  3행2열 ->9가 들어있다
	지그재그 행렬의 크기 n, 행의 위치 r, 열의 위치 c가 매개변수로 주어질 때,
	n x n 크기의 행렬의 r행 c열에 있는 숫자가 리턴되도록 solution 함수를 완성하라.
	제한 > 
	n은 1이상 10,000,000 이하의 자연수 r, c 각 1이상 n이하의 자연수
	정답이 2^31-1보다 커질 수 있음에 주의

*/



int main(void) {
	
	int aList[5][5];
	
	

	return 0;
}